blog/applications.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Productivity and Applications</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jay Kamat" />
<link rel="stylesheet" href="https://jgkamat.github.io/src/jgkamat.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Productivity and Applications</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h:xdhd2as0gyh0">1. Why Even Bother?</a></li>
<li><a href="#h:3uod2as0gyh0">2. Core</a>
<ul>
<li><a href="#h:8zvd2as0gyh0">2.1. Stability</a></li>
<li><a href="#h:1b2e2as0gyh0">2.2. Customizability</a></li>
<li><a href="#h:d98e2as0gyh0">2.3. Being Lightweight</a></li>
</ul>
</li>
<li><a href="#h:0sde2as0gyh0">3. Wrapping Up</a></li>
<li><a href="#h:vcje2as0gyh0">4. Navigation</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8d91c69" class="outline-2">
<h2 id="h:xdhd2as0gyh0"><a id="org8d91c69"></a><span class="section-number-2">1</span> Why Even Bother?</h2>
<div class="outline-text-2" id="text-h:xdhd2as0gyh0">
<p>
I'm really picky about the applications I use, mainly to make sure I'm
maximizing my productivity.
</p>

<p>
Vim was the first example I had of how much productivity matters (at least to a
programmer). A common action such as 'append text to the current line' is
<i>extremely</i> common and saving 5 seconds or so on it adds up to a <i>lot</i> of saved
time in the long run.
</p>
</div>
</div>

<div id="outline-container-orge04349d" class="outline-2">
<h2 id="h:3uod2as0gyh0"><a id="orge04349d"></a><span class="section-number-2">2</span> Core</h2>
<div class="outline-text-2" id="text-h:3uod2as0gyh0">
<p>
In general, I look for 3 things in any application before I begin relying on it.
</p>

<p>
Is the program:
</p>
<ol class="org-ol">
<li>Stable</li>
<li>Customizable</li>
<li>Lightweight</li>
</ol>

<p>
I'll talk about a few instances where I switched applications to give you a
better idea of what I'm talking about.
</p>
</div>

<div id="outline-container-org3c217c7" class="outline-3">
<h3 id="h:8zvd2as0gyh0"><a id="org3c217c7"></a><span class="section-number-3">2.1</span> Stability</h3>
<div class="outline-text-3" id="text-h:8zvd2as0gyh0">
<p>
Stability is important for obvious reasons.
If a program crashes, freezes, or stops working, you loose productivity in the
worst way possible, leaving you unable to work at all. Using older versions of
software can help with this as well, but occasionally there is software that is
completely unusable due to it's instability, which I can never use.
</p>

<p>
An example of this is <code>apvlv</code>, which I couldn't get running without segfaults
(even on multiple environments). Even older versions seemed to have the same
issue for me. Despite fitting well into my workflow otherwise, I'm unable to use
<code>apvlv</code> due to stability.
</p>
</div>
</div>

<div id="outline-container-org30c8a00" class="outline-3">
<h3 id="h:1b2e2as0gyh0"><a id="org30c8a00"></a><span class="section-number-3">2.2</span> Customizability</h3>
<div class="outline-text-3" id="text-h:1b2e2as0gyh0">
<p>
Software that is customizable helps with productivity because it makes it easy
to change the program to do exactly what you need with the least amount of
effort on your end. Customizable software also lends itself extremely well to
automation, which improves productivity immensely.
</p>

<p>
I used to use GNOME as my primary desktop environment/window manager, until
GNOME 3 was released. GNOME 3 is nice in terms of ease of use and it is very
well polished, but it lacks customizability. It's very hard to get the <i>exact</i>
behavior you want on GNOME 3, and that's why I ditched it for KDE at the time.
</p>
</div>
</div>

<div id="outline-container-orgbd78026" class="outline-3">
<h3 id="h:d98e2as0gyh0"><a id="orgbd78026"></a><span class="section-number-3">2.3</span> Being Lightweight</h3>
<div class="outline-text-3" id="text-h:d98e2as0gyh0">
<p>
Minimalist applications lend to productivity, simply because they are doing
less. Especially when on limited hardware, lightweight applications end up being
much faster to use. Minimalist software also has the added benefit that you can
reasonably understand the entire program quickly, and modify it to suit your
needs, which adds immense customizability.
</p>

<p>
For me, I ended up ditching Eclipse because it was much too heavy. It has a
immense amount of features, which is nice, but Eclipse on my computer was
unbearably slow when compared to a simple text editor. While the features of an
IDE are very appealing, I can probably never go back to using one due to this
point.
</p>
</div>
</div>
</div>

<div id="outline-container-org658ef95" class="outline-2">
<h2 id="h:0sde2as0gyh0"><a id="org658ef95"></a><span class="section-number-2">3</span> Wrapping Up</h2>
<div class="outline-text-2" id="text-h:0sde2as0gyh0">
<p>
Hopefully this post can help you become more productive. I find that even small
changes to workflow can improve productivity immensely, and reviewing the
applications you use every day can help you have more free time in the future!
</p>
</div>
</div>

<div id="outline-container-org78657f7" class="outline-2">
<h2 id="h:vcje2as0gyh0"><a id="org78657f7"></a><span class="section-number-2">4</span> Navigation</h2>
<div class="outline-text-2" id="text-h:vcje2as0gyh0">
<div class="div-wrap">
<div class="div-left">
<p>
<a href="website1.html">&larr; Creating A Blog in Org Mode</a>
</p>

</div>
<div class="div-center">
<p>
<a href="home.html">⟨Blog Home⟩</a>
</p>

</div>
<div class="div-right">
<p>
<a href="slack.html">Breaking Slack &rarr;</a>
</p>

</div>

</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://github.com/jgkamat/jgkamat.github.io">Jay Kamat</a></p>
<p class="date">Published: 2017-01-22</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="https://orgmode.org">Org</a> mode 9.1.13)</p>
</div>
</div>
</body>
</html>
